import 'package:etma2n/model/consModel.dart';

List<ConsModel> consultation = [
  ConsModel(
      'قلق زيادة _حالات حزن غير مبررة بشكل   غير مبرر _ توتر مبالغ فيه لأقل سبب',
      'استعيني بالله.. وفكري في اسوأ حاجة ممكن تحصل .. هتقدري تتعلملي معاها ازاي ؟؟ ثم احسني الظن بالله فانا عند حسن ظن عبدي بي فليظن بي ما يشاء.. لو الموضوع دا موقفك في حياتك او معطلك يبقى لازم استشارة متخصص'),
  ConsModel(
      'بحس ديمااااا ان انا أقل من الناس لا حوليه وانى ضعيفه وبلاشخصية من كتر الطيبه الا بشفها ديمااا سذاجه وغباء',
      'ماتقارنيش نفسك بالاخرين.. قارني نفسك الحالية بنفسك القديمة.. ثقفي نفسك خدي كورسات او اقري كتب وركزي على تقدير الذات وكمان اخطاء التفكير'),
  ConsModel('فقدان الثقة بالنفس والشعور الدائم بالحزن',
      'فقدان الثقة ممكن بسبب خبرات مبكره مكتسباها من البيئة اللى كانت حواليكي فى مرحله الطفوله وا التعرض فيها للنقد سواء فى الشكل او الجسم او الذكاء او الفشل والغباء او الأداء '),
  ConsModel(
      'حاله من عدم الاتزان النفسي ممكن اكون فرحانه ويضحك بس انا محتاجه اعيط و بزعل من اي حاجه بسرعه اوي ومش بعرف اتحكم في عواطفي',
      'عدم الأتزان لأنها مضغوطه مشاعريا وبتحاول تظهر بعكس ده بالضحك وده خطر جدا لأنها بتكبت مشاعرها الحقيقيه ومش عارفه تتعامل معاها وده ممكن يؤدى للانفجار بعد كده لو ما عرفتش تعمل تفريغ للضغوط دى'),
  ConsModel('عدم الثقة في نفسى وفقدان الشغف  التنمر',
      'عدم الثقة في نفسى وفقدان الشغف  التنمر'),
  ConsModel(
      'اني الفتره دي بمر بتعب جسدي ونفسي وعدم القدره علي المذاكره مع اني ماشيه ف الدراسه كويس بس مش قادره اذاكر مش قادره اعمل اي حاجه ف.حياتي ودايما مكتئبه مش عايزه اكلم حد ولا اتعامل مع حد ولا اتواصل مع اي حد ولو بكلمه واهلي خصوصا ببقي مش عايزه اتعامل معاهم ببقي طول الوقت بتمني الموت حرفيا',
      'التعب الجسدى ممكن يكون اصله تعب نفسى فهى محتاجه تتواصل مع متخصص لانه  اللى هى بتحكيه ده من بوادر  اعراض الأكتئاب البسيط وده بيتعالج باذن الله بالcbt'),
  ConsModel(
      'التوتر ، انا اقل حاجه بتوترني لو اي مشكله او اي حد عملت معاه موقف وحش مثلا واتكلم معايا بطريقه عنيفه أو حسيت أنه شخص مش طيب مثلا وممكن يأذيني ممكن اتوتر لدرجه تخليني ارجع طول الليل واخد حقن عشان الترجيع يقف وغير وجع بطني وقلبي مقبوض وخايفه من الشخص وممكن ده يخليني اتصرف تصرف هيضرني زي اني اروح أكلمه وأبوظ الدنيا اكتر أو انقله خوفي',
      'محتاجة تفريغ مشاعر ضروووري وكمان كشف دكتور باطنة لان ممكن يكون في مرض عضوي اسالي نفسك ايه الافكار اللي بتجيلك وقت التوتر.. واكتبيها.. واستبدليها بافكار تانية ايجابية  وفكري نفسك بيها دايما وممكن تستعيني بحد يساعدك'),
/*ConsModel('', ''),
ConsModel('', ''),*/
];
