import 'package:etma2n/model/question_model.dart';

List<QuestionModel> depressionqQestions = [
  QuestionModel("قلة الاهتمام أو قلة الاستمتاع بممارسة بالقيام بأي عمل", {
    "أبدا": 1,
    "بعض الأيام": 2,
    "أكثر من نص الأيام": 3,
    "كل يوم تقريبا": 4,
  }),
  QuestionModel("الشعور بالحزن أو ضيق الصدر أو اليأس", {
    "أبدا": 1,
    "بعض الأيام": 2,
    "أكثر من نص الأيام": 3,
    "كل يوم تقريبا": 4,
  }),
  QuestionModel("صعوبة في النوم أو نوم متقطع أو النوم أكثر من المعتاد", {
    "أبدا": 1,
    "بعض الأيام": 2,
    "أكثر من نص الأيام": 3,
    "كل يوم تقريبا": 4,
  }),
  QuestionModel("الشعور بالتعب أو بامتلاك القليل جداً من الطاقة", {
    "أبدا": 1,
    "بعض الأيام": 2,
    "أكثر من نص الأيام": 3,
    "كل يوم تقريبا": 4,
  }),
  QuestionModel("قلة الشهية أو الزيادة في تناول الطعام عن المعتاد", {
    "أبدا": 1,
    "بعض الأيام": 2,
    "أكثر من نص الأيام": 3,
    "كل يوم تقريبا": 4,
  }),
  QuestionModel("الشعور بعدم الرضا عن النفس أو الشعور بأنك قد خذلت نفسك أو عائلتك", {
    "أبدا": 1,
    "بعض الأيام": 2,
    "أكثر من نص الأيام": 3,
    "كل يوم تقريبا": 4,
  }),
  QuestionModel("صعوبة في التركيز مثلاً أثناء قراءة الصحيفة أو مشاهدة التلفزيون", {
    "أبدا": 1,
    "بعض الأيام": 2,
    "أكثر من نص الأيام": 3,
    "كل يوم تقريبا": 4,
  }),
  QuestionModel("بطء في الحركة أو بطء في التحدث عما هو معتاد لدرجة ملحوظة من الآخرين / أو على العكس من ذلك التحدث بسرعة وكثرة الحركة أكثر من المعتاد", {
    "أبدا": 1,
    "بعض الأيام": 2,
    "أكثر من نص الأيام": 3,
    "كل يوم تقريبا": 4,
  }),
  QuestionModel("راودتك أفكار بأنه من الأفضل لو كنت ميتا أو أفكار بأن تقوم بإيذاء النفس", {
    "أبدا": 1,
    "بعض الأيام": 2,
    "أكثر من نص الأيام": 3,
    "كل يوم تقريبا": 4,
  }),
  /*QuestionModel("", {
    "أبدا": 1,
    "بعض الأيام": 2,
    "أكثر من نص الأيام": 3,
    "كل يوم تقريبا": 4,
  }),
  QuestionModel("", {
    "أبدا": 1,
    "بعض الأيام": 2,
    "أكثر من نص الأيام": 3,
    "كل يوم تقريبا": 4,
  }),
  QuestionModel("", {
    "أبدا": 1,
    "بعض الأيام": 2,
    "أكثر من نص الأيام": 3,
    "كل يوم تقريبا": 4,
  }),
  QuestionModel("", {
    "أبدا": 1,
    "بعض الأيام": 2,
    "أكثر من نص الأيام": 3,
    "كل يوم تقريبا": 4,
  }),
  QuestionModel("", {
    "أبدا": 1,
    "بعض الأيام": 2,
    "أكثر من نص الأيام": 3,
    "كل يوم تقريبا": 4,
  }),
  QuestionModel("", {
    "أبدا": 1,
    "بعض الأيام": 2,
    "أكثر من نص الأيام": 3,
    "كل يوم تقريبا": 4,
  }),
  QuestionModel("", {
    "أبدا": 1,
    "بعض الأيام": 2,
    "أكثر من نص الأيام": 3,
    "كل يوم تقريبا": 4,
  }),*/

];
