import 'package:etma2n/model/question_model.dart';

List<QuestionModel> OCDQestions = [
  QuestionModel("ما هو مقدار الوقت الذي تشغله الأفكار الوسواسية؟", {
    "أبدا": 1,
    "بعض الأيام": 2,
    "أكثر من نص الأيام": 3,
    "كل يوم تقريبا": 4,
  }),
  QuestionModel("ما هو مقدار التدخل الذي تحدثه الأفكار الوسواسية مع نشاطاتك الاجتماعية والعملية وغيرها؟", {
    "أبدا": 1,
    "بعض الأيام": 2,
    "أكثر من نص الأيام": 3,
    "كل يوم تقريبا": 4,
  }),
  QuestionModel("ما هو مقدار سيطرتك على الأفكار الوسواسية؟", {
    "أبدا": 1,
    "بعض الأيام": 2,
    "أكثر من نص الأيام": 3,
    "كل يوم تقريبا": 4,
  }),
  QuestionModel("ما هو مقدار التوتر الذي تسببه للأفكار الوسواسية؟", {
    "أبدا": 1,
    "بعض الأيام": 2,
    "أكثر من نص الأيام": 3,
    "كل يوم تقريبا": 4,
  }),
  QuestionModel("ما هو مقدار الجهد الذي تبذله في مقاومة الأفكار الوسواسية؟ ", {
    "أبدا": 1,
    "بعض الأيام": 2,
    "أكثر من نص الأيام": 3,
    "كل يوم تقريبا": 4,
  }),
  QuestionModel("ما هو كم الوقت الذي تمضيه في القيام بالأفعال القهرية؟", {
    "أبدا": 1,
    "بعض الأيام": 2,
    "أكثر من نص الأيام": 3,
    "كل يوم تقريبا": 4,
  }),
  QuestionModel("صعوبة في التركيز مثلاً أثناء قراءة الصحيفة أو مشاهدة التلفزيون", {
    "أبدا": 1,
    "بعض الأيام": 2,
    "أكثر من نص الأيام": 3,
    "كل يوم تقريبا": 4,
  }),
  QuestionModel("ما هو مقدار التدخل الذي تحدثه الأفعال القهرية في نشاطاتك الاجتماعية والعملية وغيرها؟ ", {
    "أبدا": 1,
    "بعض الأيام": 2,
    "أكثر من نص الأيام": 3,
    "كل يوم تقريبا": 4,
  }),
  QuestionModel("ما هو مقدار التوتر الناتج في حال تم منعك عن القيام بالأفعال القهرية؟", {
    "أبدا": 1,
    "بعض الأيام": 2,
    "أكثر من نص الأيام": 3,
    "كل يوم تقريبا": 4,
  }),
  QuestionModel("ما هو مقدار الجهد المبذول منك في مقاومة الأفعال القهرية؟", {
    "أبدا": 1,
    "بعض الأيام": 2,
    "أكثر من نص الأيام": 3,
    "كل يوم تقريبا": 4,
  }),
  QuestionModel("ما هو مقدار سيطرتك على الأفعال القهرية؟", {
    "أبدا": 1,
    "بعض الأيام": 2,
    "أكثر من نص الأيام": 3,
    "كل يوم تقريبا": 4,
  }),
  /*QuestionModel("", {
    "أبدا": 1,
    "بعض الأيام": 2,
    "أكثر من نص الأيام": 3,
    "كل يوم تقريبا": 4,
  }),
  QuestionModel("", {
    "أبدا": 1,
    "بعض الأيام": 2,
    "أكثر من نص الأيام": 3,
    "كل يوم تقريبا": 4,
  }),
  QuestionModel("", {
    "أبدا": 1,
    "بعض الأيام": 2,
    "أكثر من نص الأيام": 3,
    "كل يوم تقريبا": 4,
  }),
  QuestionModel("", {
    "أبدا": 1,
    "بعض الأيام": 2,
    "أكثر من نص الأيام": 3,
    "كل يوم تقريبا": 4,
  }),
  QuestionModel("", {
    "أبدا": 1,
    "بعض الأيام": 2,
    "أكثر من نص الأيام": 3,
    "كل يوم تقريبا": 4,
  }),
  QuestionModel("", {
    "أبدا": 1,
    "بعض الأيام": 2,
    "أكثر من نص الأيام": 3,
    "كل يوم تقريبا": 4,
  }),
  QuestionModel("", {
    "أبدا": 1,
    "بعض الأيام": 2,
    "أكثر من نص الأيام": 3,
    "كل يوم تقريبا": 4,
  }),*/

];
