import 'package:etma2n/model/question_model.dart';

List<QuestionModel> questions1 = [
  QuestionModel(
      "ذكريات متكررة مزعجة أو أفكار أو صور للخبرة الصادمة من الماضي", {
    "أبدا": 1,
    "بعض الأيام": 2,
    "أكثر من نص الأيام": 3,
    "كل يوم تقريبا": 4,
  }),
  QuestionModel("أحلام متكررة ومقلقة عن الخبرة الصادمة السابقة", {
    "أبدا": 1,
    "بعض الأيام": 2,
    "أكثر من نص الأيام": 3,
    "كل يوم تقريبا": 4,
  }),
  QuestionModel("شعور مفاجئ بأن التجربة تعاد مرة اخرى (تشعر وكأنك في داخلها)", {
    "أبدا": 1,
    "بعض الأيام": 2,
    "أكثر من نص الأيام": 3,
    "كل يوم تقريبا": 4,
  }),
  QuestionModel("تشعر بالضيق عندما يحدث أي شئ يذكرك بالتجربة السابقة", {
    "أبدا": 1,
    "بعض الأيام": 2,
    "أكثر من نص الأيام": 3,
    "كل يوم تقريبا": 4,
  }),
  QuestionModel(
      "ردود فعل جسمانية ( سرعة خفقان القلب، عرق، صعوبة في التنفس) عندما تتذكر شيء من الخبرة الصادمة",
      {
        "أبدا": 1,
        "بعض الأيام": 2,
        "أكثر من نص الأيام": 3,
        "كل يوم تقريبا": 4,
      }),
  QuestionModel("تتجنب التفكير أو الحديث او المشاعر المرتبطة بالخبرة الصادمة", {
    "أبدا": 1,
    "بعض الأيام": 2,
    "أكثر من نص الأيام": 3,
    "كل يوم تقريبا": 4,
  }),
  QuestionModel("تتجنب المواقف التي تذكر بالخبرة الصادمة", {
    "أبدا": 1,
    "بعض الأيام": 2,
    "أكثر من نص الأيام": 3,
    "كل يوم تقريبا": 4,
  }),
  QuestionModel("تعاني مشكلة في تذكر بعض الأجزاء عن الخبرة الصادمة", {
    "أبدا": 1,
    "بعض الأيام": 2,
    "أكثر من نص الأيام": 3,
    "كل يوم تقريبا": 4,
  }),
  QuestionModel("فقدان الاستمتاع بالأشياء التي كنت تستمتع بها في السابق", {
    "أبدا": 1,
    "بعض الأيام": 2,
    "أكثر من نص الأيام": 3,
    "كل يوم تقريبا": 4,
  }),
  QuestionModel("الشعور بأن مستقبلك سوف ينتهي قريبا", {
    "أبدا": 1,
    "بعض الأيام": 2,
    "أكثر من نص الأيام": 3,
    "كل يوم تقريبا": 4,
  }),
  QuestionModel("أصبحت مترقبا جدا أو في حالة دائمة من الحذر ", {
    "أبدا": 1,
    "بعض الأيام": 2,
    "أكثر من نص الأيام": 3,
    "كل يوم تقريبا": 4,
  }),
];
