import 'package:bloc/bloc.dart';
import 'package:etma2n/layout/consultation/con_cubit/states.dart';
import 'package:flutter_bloc/flutter_bloc.dart';

class ConsCubit extends Cubit<ConsStates> {
  ConsCubit() : super(ConsInitialState());

  static ConsCubit get(context) => BlocProvider.of(context);
  String selectedDoctor = "اختار الدكتور";
 // void doctorSelected
  late List<String> ConQuest = ['قلق زيادة _حالات حزن غير مبررة بشكل   غير مبرر _ توتر مبالغ فيه لأقل سبب',
    'بحس ديمااااا ان انا أقل من الناس لا حوليه وانى ضعيفه وبلاشخصية من كتر الطيبه الا بشفها ديمااا سذاجه وغباء',
    'فقدان الثقة بالنفس والشعور الدائم بالحزن',
    'التوتر ، انا اقل حاجه بتوترني لو اي مشكله او اي حد عملت معاه موقف وحش مثلا واتكلم معايا بطريقه عنيفه أو حسيت أنه شخص مش طيب مثلا وممكن يأذيني ممكن اتوتر لدرجه تخليني ارجع طول الليل واخد حقن عشان الترجيع يقف وغير وجع بطني وقلبي مقبوض وخايفه من الشخص وممكن ده يخليني اتصرف تصرف هيضرني زي اني اروح أكلمه وأبوظ الدنيا اكتر أو انقله خوفي',
    'ازاى اقلل التوتر والقلق وزيادة التفكير اللى بتكون عندى دايما'
  ];


  late List<String> ConQ = ['قلق زيادة _حالات حزن غير مبررة بشكل   غير مبرر _ توتر مبالغ فيه لأقل سبب',
    'بحس ديمااااا ان انا أقل من الناس لا حوليه وانى ضعيفه وبلاشخصية من كتر الطيبه الا بشفها ديمااا سذاجه وغباء',
    'فقدان الثقة بالنفس والشعور الدائم بالحزن',

  ];


  late List<String> ConA = [    'استعيني بالله.. وفكري في اسوأ حاجة ممكن تحصل .. هتقدري تتعلملي معاها ازاي ؟؟ ثم احسني الظن بالله فانا عند حسن ظن عبدي بي فليظن بي ما يشاء.. لو الموضوع دا موقفك في حياتك او معطلك يبقى لازم استشارة متخصص',
    'ماتقارنيش نفسك بالاخرين.. قارني نفسك الحالية بنفسك القديمة.. ثقفي نفسك خدي كورسات او اقري كتب وركزي على تقدير الذات وكمان اخطاء التفكير',
    'فقدان الثقة ممكن بسبب خبرات مبكره مكتسباها من البيئة اللى كانت حواليكي فى مرحله الطفوله وا التعرض فيها للنقد سواء فى الشكل او الجسم او الذكاء او الفشل والغباء او الأداء ',

  ];

}
