
import 'doctors_model.dart';

List<ArticlesModel> article = [
  //1
  ArticlesModel(
      'مفهوم الصحة النفسية',
      'الصحة النفسية هي مستوى رفاهنا النفسي ، وأنها تشمل الحالة الاجتماعية والفسيولوجية والعاطفية ، وقد يشعر الشخص الذي يتمتع بصحة عقلية جيدة بالتوازن في هذه المجالات من حياته.',
      '1 day',
    doctor[1].docname,
    doctor[1].docpic,
  ),


  //2
  ArticlesModel(
      'أسباب المرض النفسي',
      'الصحة النفسية هي مستوى رفاهنا النفسي ، وأنها تشمل الحالة الاجتماعية والفسيولوجية والعاطفية ، وقد يشعر الشخص الذي يتمتع بصحة عقلية جيدة بالتوازن في هذه المجالات من حياته.',
      '13 مارس',
    doctor[2].docname,
    doctor[2].docpic,
  ),

  //3
  ArticlesModel(
      'حقائق عن الصحة العقلية',
      'أكثر من 450 مليون شخص يعانون من اضطرابات نفسية ، ووفقًا لمنظمة الصحة العالم ية في عام 2020 ، سيشكل الاكتئاب ثاني أكبر عبء مرضي في جميع أنحاء العالم ، إن العبء العالمي للصحة النفسية سوف يتجاوز بكثير القدرات العلاجية للبلدان المتقدمة والنامية ، ركزت التكاليف الاجتماعية والاقتصادية المرتبطة بالعبء المتزايد لاعتلال الصحة العقلية على إمكانيات تعزيز الصحة النفسية بالإضافة إلى الوقاية من الأمراض العقلية وعلاجها ، وبالتالي فإن الصحة النفسية مرتبطة بالسلوك ويُنظر إليها على أنها أساسية للصحة الجسدية ونوعية الحياة ولها أهمية كبيرة .',
      '15 ديسمبر',
    doctor[3].docname,
    doctor[3].docpic,
  ),

  //4
  ArticlesModel(
      'أسباب المرض النفسي',
      'أكثر من 450 مليون شخص يعانون من اضطرابات نفسية ، ووفقًا لمنظمة الصحة العالم ية في عام 2020 ، سيشكل الاكتئاب ثاني أكبر عبء مرضي في جميع أنحاء العالم ، إن العبء العالمي للصحة النفسية سوف يتجاوز بكثير القدرات العلاجية للبلدان المتقدمة والنامية ، ركزت التكاليف الاجتماعية والاقتصادية المرتبطة بالعبء المتزايد لاعتلال الصحة العقلية على إمكانيات تعزيز الصحة النفسية بالإضافة إلى الوقاية من الأمراض العقلية وعلاجها ، وبالتالي فإن الصحة النفسية مرتبطة بالسلوك ويُنظر إليها على أنها أساسية للصحة الجسدية ونوعية الحياة ولها أهمية كبيرة .',
      '1 ابرايل',
      doctor[4].docname,
      doctor[4].docpic,
  ),

  //5
  ArticlesModel(
      'العوامل المؤثرة على الصحة النفسية',
      'أكثر من 450 مليون شخص يعانون من اضطرابات نفسية ، ووفقًا لمنظمة الصحة العالم ية في عام 2020 ، سيشكل الاكتئاب ثاني أكبر عبء مرضي في جميع أنحاء العالم ، إن العبء العالمي للصحة النفسية سوف يتجاوز بكثير القدرات العلاجية للبلدان المتقدمة والنامية ، ركزت التكاليف الاجتماعية والاقتصادية المرتبطة بالعبء المتزايد لاعتلال الصحة العقلية على إمكانيات تعزيز الصحة النفسية بالإضافة إلى الوقاية من الأمراض العقلية وعلاجها ، وبالتالي فإن الصحة النفسية مرتبطة بالسلوك ويُنظر إليها على أنها أساسية للصحة الجسدية ونوعية الحياة ولها أهمية كبيرة .',
      '1 فبراير',
    doctor[5].docname,
    doctor[5].docpic,
  ),

  //6
  ArticlesModel(
      'حقائق عن الصحة العقلية',
      'أكثر من 450 مليون شخص يعانون من اضطرابات نفسية ، ووفقًا لمنظمة الصحة العالم ية في عام 2020 ، سيشكل الاكتئاب ثاني أكبر عبء مرضي في جميع أنحاء العالم ، إن العبء العالمي للصحة النفسية سوف يتجاوز بكثير القدرات العلاجية للبلدان المتقدمة والنامية ، ركزت التكاليف الاجتماعية والاقتصادية المرتبطة بالعبء المتزايد لاعتلال الصحة العقلية على إمكانيات تعزيز الصحة النفسية بالإضافة إلى الوقاية من الأمراض العقلية وعلاجها ، وبالتالي فإن الصحة النفسية مرتبطة بالسلوك ويُنظر إليها على أنها أساسية للصحة الجسدية ونوعية الحياة ولها أهمية كبيرة .',
      '6 اكتوبر',
    doctor[6].docname,
    doctor[6].docpic,
  ),
];

class ArticlesModel {
  String arttitle;
  String artcontant;
  String arttime;
  String writername;
  String writerimage;

  ArticlesModel(this.arttitle, this.artcontant, this.arttime, this.writername,
      this.writerimage,);
}
