
import 'doctors_model.dart';

List<ArticlesModel> article = [
  //1
  ArticlesModel(
    'مفهوم الصحة النفسية',
    '''
      أحيانًا تكون المعاناة من القلق جزءًا طبيعيًّا من الحياة. ومع ذلك، فإنَّ الأشخاص الذين يعانون من اضطرابات القلق غالبًا ما يكون لديهم مخاوف وخوف مفرط ومستمر من المواقف اليومية. وفي كثير من الأحيان، تتضمن اضطرابات القلق نوبات متكررة من المشاعر المفاجئة للقلق الشديد والخوف أو الرعب، وتصل إلى ذروتها في غضون دقائق (نوبات الهلع).
      تشمَل العلامات والأعراض الشائعة للقلق ما يلي:

الشعور بالعصبيَّة أو القلق أو التوتُّر
الشعور بالخطر الوَشيك أو الذُّعر أو التَّشاؤم
الإصابة بزيادة مُعدَّل ضربات القلب
زيادة مُعدَّل التنفُّس (فرط التهوية)
التعرُّق
الارتِجاف
الشعور بالضَّعف أو التَّعب
التركيز على الصُّعوبات أو التفكير في أيِّ أمرٍ بِخلاف القلق الحالي.
الإصابة بصعوبة في النوم
تُوجَد عدَّة أنواع من اضطرابات القلق وهي:

رُهاب المَيادين وهو نوع من اضطرابات القلق التي تشعُر فيها بالخوف وتتجنَّب غالبًا التواجُد في أماكن أو مواقف قد تتسبَّب في وجود الهلَع وتجعلك تشعُر بالاحتِباس أو العجْز أو الإحراج.
يشمل اضطراب القلَق بسبب مشكلة طبية وجود أعراض القلق أو الذُّعر المُفرِط والذي ينتُج مُباشرة عن مشكلة صحية جسدية.
يشمل اضطراب القلق العام القلق المُستمرِّ والمُفرِط والقلق من الأنشطة أو الأحداث وحتى المشكلات العادية والرُّوتينية. ومن الصَّعب السَّيطرة على القلق غير المُتناسِب مع الموقِف الفِعلي ويؤثِّر على كيفية شعورك جسديًّا. وكثيرًا ما يحدُث ذلك بالتزامُن مع الاكتئاب أو اضطرابات القلق الأخرى.
      ''',
    'منذ يوم',
    doctor[1].docname,
    doctor[1].docpic,
  ),


  //2
  ArticlesModel(
    'الصحة النفسية',
    '''
الصحة النفسية جزء لا يتجزّأ من الصحة؛ وبالفعل، لا تكتمل الصحة بدون الصحة النفسية.
الصحة النفسية تتأثّر بالعوامل الاجتماعية الاقتصادية والبيولوجية والبيئية.
هناك استراتيجيات وتدخلات مشتركة بين القطاعات وعالية المردود لتعزيز الصحة النفسية.
إنّ الصحة النفسية جزء أساسي لا يتجزّأ من الصحة. وفي هذا الصدد ينص دستور منظمة الصحة العالمية على أنّ "الصحة هي حالة من اكتمال السلامة بدنياً وعقلياً واجتماعياً، لا مجرّد انعدام المرض أو العجز". ومن أهمّ آثار هذا التعريف أنّ شرح الصحة النفسية يتجاوز مفهوم انعدام الاضطرابات أو حالات العجز النفسية.
والصحة النفسية عبارة عن حالة من العافية يمكن فيها للفرد تكريس قدراته او قدراتها الخاصة والتكيّف مع أنواع الإجهاد العادية والعمل بتفان وفعالية والإسهام في مجتمعه او مجتمعها.
تعتبر الصحة النفسية والمعافاة من الأمور الأساسية لتوطيد قدرتنا الجماعية والفردية على التفكير، التأثر، والتفاعل مع بعضنا البعض كبشر، وكسب لقمة العيش والتمتع بالحياة. وعلى هذا الأساس، يمكن اعتبار تعزيز الصحة النفسية وحمايتها واستعادتها شاغلاً حيويا للأفراد والجماعات والمجتمعات في جميع أنحاء العالم.
      ''',
    '13 مارس',
    doctor[2].docname,
    doctor[2].docpic,
  ),

  //3
  ArticlesModel(
    'اضطراب فرط الحركة وتشتت الانتباه',

    '''
      اضطراب فرط الحركة وتشتت الانتباه:-
تعترف المعاهد الوطنية للصحة، ومراكز السيطرة على الأمراض والوقاية منها، والجمعية الأمريكية للطب النفسي باضطراب فرط الحركة وتشتت الانتباه كواحد من أكثر الأمراض شيوعاً في الطفولة.
ويعد اضطراب فرط الحركة وتشتت الانتباه مرض وراثي، حيث أن 1 من كل 4 أشخاص مصابون باضطراب فرط الحركة وتشتت الانتباه لديه أحد الوالدين مصاب بالاضطراب. كما تبين وجود اختلافات في نمو الدماغ بين الأشخاص المصابين باضطراب فرط الحركة وتشتت الانتباه والأشخاص غير المصابين به.
ثانياً: لا تصاب الفتيات باضطراب فرط الحركة وتشتت الانتباه
بشكل عام، لا يرجح أن تكون الفتيات الصغيرات مفرطات النشاط مثل الفتيان الصغار؛ لذلك لا يتم التعرف غالباً على اضطراب فرط الحركة وتشتت الانتباه عند الفتيات بسبب عدم تشخيص الإصابة بالاضطراب.
وتكمن مشكلة هذا المعتقد في أنه نظراً لأنه غالباً لا يتم علاج الفتيات المصابات باضطراب فرط الحركة وتشتت الانتباه، يمكن أن تتطور حالتهن مما يؤدي إلى زيادة مشكلات مثل القلق، والشخصية المعادية للمجتمع، والاضطرابات المرضية الأخرى في مرحلة البلوغ. ولهذا، من المهم تحسين القدرة على تشخيص الفتيات المصابات باضطراب فرط الحركة وتشتت الانتباه وتزويدهن بالدعم الذي يحتجن إليه.
للمزيد: التغيير في النظام الغذائي يحسن أعراض متلازمة فرط الحركة ونقص الانتباه
ثالثاً: اضطراب فرط الحركة وتشتت الانتباه لا يصيب الرضع
يعتقد العديد من الآباء أن اضطراب فرط الحركة وتشتت الانتباه يمثل مشكلة للأطفال في سن المدرسة فقط. ولكن في الواقع، يمكن أن تظهر أعراض هذا الاضطراب ويتم تشخيص الحالة في وقت مبكر، مثل سنوات ما قبل المدرسة. وفي بعض الأحيان، يواجه الأطباء صعوبة في التمييز بين السلوك الطبيعي والسلوك الذي يشير إلى اضطراب فرط الحركة وتشتت الانتباه لدى الأطفال في هذه الفئة العمرية.
وعلى الرغم من أن الطفل الصغير قد يكون له عادة خصائص مثل السلوك الاندفاعي أو فرط النشاط، إلا أن هذه يمكن أن تكون أعراضاً لاضطراب فرط الحركة وتشتت الانتباه أيضاً. وينبغي أن يقوم الطبيب بتقييم شدة هذه السلوكيات للمساعدة في إجراء التشخيص. ويتم تشخيص الاضطراب عندما تصل هذه السلوكيات إلى النقطة التي تتدخل فيها بشكل كبير في حياة طفل ما قبل المدرسة، ونموه، وتقديره لذاته، وأدائه العام.
      ''',
    '15 ديسمبر',
    doctor[3].docname,
    doctor[3].docpic,
  ),

  //4
  ArticlesModel(
    'أسباب الاكتئاب الشديد',
    '''
      الاكتئاب الشديد (اخطر أنواع الاكتئاب)
يسمى الاكتئاب الشديد (بالإنجليزية: Major Depression)، أو الاكتئاب الرئيسي، أو الاكتئاب أحادي القطب، وهو أحد أنواع الاكتئاب الشائعة، يعاني المصاب بالاكتئاب الشديد من استمرار الأعراض طوال الوقت، ويعتبر أخطر أنواع الاكتئاب، وقد تستمر الأعراض أسابيع أو أشهر، تتضمن أعراض الاكتئاب الشديد ما يأتي:
الأرق أو النوم فترات طويلة.
الشعور باليأس.
فقدان الشهية أو الإفراط في تناول الطعام.
الشعور بالحزن.
فقدان الطاقة والشعور بالتعب.
الشعور بألم دون سبب محدد.
فقدان الاهتمام بالأنشطة المفصلة.
انخفاض معدل التركيز واضطراب الذاكرة.
فقدان القدرة على اتخاذ القرارات.
أفكار بالانتحار أو الموت أو إيذاء النفس.
      ''',
    '1 ابرايل',
    doctor[4].docname,
    doctor[4].docpic,
  ),

  //5
  ArticlesModel(
    'عوامل الاكتئاب المستمر',
    ''' الاكتئاب المستمر ما يلي:
الشعور بالحزن العميق.
اضطرابات في الشهية.
اضطرابات النوم.
انخفاض الطاقة.
تدني احترام الذات.
عدم الاهتمام النشاطات المفضلة.
حدوث مشاكل في التركيز والذاكرة.
مواجهة صعوبة في المدرسة أو العمل.
فقدان الشعور بالبهجة والسعادة.
العزلة.
يعد هذا النوع من الاكتئاب طويل الأمد، إلا أن أعراضه يمكن تتفاوت من متوسطة إلى شديدة، وقد يعاني بعض المصابين من نوبات الاكتئاب الشديد قبل أو أثناء الإصابة بالاكتئاب المستمر، وفي هذه الحالة يسمى الاكتئاب المزدوج.
والجدير بالذكر أن الاكتئاب المستمر يستمر لسنوات في كل مرة يعود فيها، لذا يبدأ الأشخاص المصابون بهذا النوع من الاكتئاب في الشعور بأن أعراضهم ليست سوى جزء من نظرتهم الطبيعية للحياة.
''',
    '1 فبراير',
    doctor[5].docname,
    doctor[5].docpic,
  ),

  //6
  ArticlesModel(
    'اضطراب ثنائي القطب',
    '''
حالة مرضية من حالات الصحية عقلية وهو شائع إلى حد ما.
يتم تشخيص إصابة شخص واحد من بين كل 100 شخص به في مرحلة ما من حياتهم.
نمط تقلب المزاج في الاضطراب الثنائي القطب يختلف على نطاق واسع من شخص إلى آخر.
غالبًا ما تستمر نوبات الهوس والاكتئاب لأسابيع أو أشهر عدة.
تؤدي الظروف أو المواقف المجهدة – في الغالب – إلى ظهور أعراض اضطراب ثنائي القطب.
تعريف اضطراب ثنائي القطب:
هي اضطرابات الدماغ التي تسبب تغيرات في مزاج الشخص وطاقته وقدرته على العمل، وهو حالة من حالات الصحة العقلية التي تؤثر في الحالة المزاجية؛ حيث يتأرجح المزاج بين المرتفع جدًا (الهوس) والمنخفض جدًا (الاكتئاب). كما يمر المريض أيضًا ببعض الفترات من المزاج الطبيعي.
مسميات أخرى:
الاكتئاب الهوسي.
السبب:ما زال السبب الدقيق له غير معروف، ولكن يُعتقد أن هناك بعض العوامل تكون مزيجًا معقدًا من العوامل المادية، والبيئية، والاجتماعية، والتي يمكن أن تؤدي إلى حدوث الاضطراب، وتشمل: 

اختلال التوازن الكيميائي في الدماغ لمستويات الناقلات العصبية، وهي مواد كيميائية مسؤولة عن التحكم في وظائف الدماغ (مثل: النورادرينالين، والسيروتونين، والدوبامين).
علم الوراثة؛ حيث يُعتقد أن الاضطراب ثنائي القطب مرتبط بالوراثة.
غالبًا ما تؤدي الظروف أو المواقف المجهدة إلى ظهور أعراض الاضطراب ثنائي القطب.
الإجهاد النفسي الشديد.
المشاكل الشديدة في الحياة اليومية (مثل: مشاكل المال، أو العمل، أو العلاقات).
الأحداث المؤثرة في الحياة (مثل: وفاة أحد المقربين).
اضطرابات النوم.
      ''',
    '6 مايو',
    doctor[6].docname,
    doctor[6].docpic,
  ),
];

class ArticlesModel {
  String arttitle;
  String artcontant;
  String arttime;
  String writername;
  String writerimage;

  ArticlesModel(this.arttitle, this.artcontant, this.arttime, this.writername,
      this.writerimage,);
}
